
## Plan Result (dev)

[CI link](https://github.com/fumi-mura/tfaction-sample/actions/runs/17862822925)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.cwlogs3.aws_cloudwatch_log_group.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.cwlogs3.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "test3"
      + name_prefix       = (known after apply)
      + region            = "ap-northeast-1"
      + retention_in_days = 30
      + skip_destroy      = false
      + tags_all          = {
          + "Environment"        = "dev"
          + "ManagedByTerraform" = "true"
          + "ServiceName"        = "tfaction-sample"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":20,"Program":"tfcmt","SHA1":"4c0a3dedbcd64e165373b684fe5dc6d6f15101f6","Target":"dev","Vars":{},"WorkflowName":"Terraform plan"} -->